Pandas DataFrames is two-dimensional, size-mutable (size changeable),potentially heterogeneous tabular data structure with labeled axes (rows and column has names)

In [1]:
import pandas as pd

In [6]:
# To create empty data frame
empty = pd.DataFrame([])
empty

Empty DataFrame
Columns: []
Index: []

In [7]:
# To create DataFrame with the help of list

lists = [1,2,3,4,'suhesh','series']
data = pd.DataFrame(lists)
data

        0
0       1
1       2
2       3
3       4
4  suhesh
5  series

In [10]:
# To create multiple column using lists

list11 =[['anna','bell','pepper',5,6,11],[1,2,3,'angel','abanish','smarika']] 
data1 = pd.DataFrame(list11)
data1

      0     1       2      3        4        5
0  anna  bell  pepper      5        6       11
1     1     2       3  angel  abanish  smarika

In [14]:
# Data dictionary

dic = {'ID':[1,2,3,4,5]}
datadic = pd.DataFrame(dic)
datadic

   ID
0   1
1   2
2   3
3   4
4   5

In [18]:
# dictionary with series

datas = {'Id':pd.Series([1,2,3,4,5]),"Name":pd.Series(["Anjila","Maya","Ram","Shreejan","Unisha"])}
printt = pd.DataFrame(datas)
printt

   Id      Name
0   1    Anjila
1   2      Maya
2   3       Ram
3   4  shreejan
4   5    Unisha